EmmanuelHernandezGonzalez/ProyectosFinales/Tema02Proyecto02_Semaforo/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t OESTE_SENSOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA1 (pin 27)  */
    GPIO_PinInit(BOARD_INITPINS_OESTE_SENSOR_GPIO, BOARD_INITPINS_OESTE_SENSOR_PIN, &OESTE_SENSOR_config);

    gpio_pin_config_t OESTE_VUELTA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA2 (pin 28)  */
    GPIO_PinInit(BOARD_INITPINS_OESTE_VUELTA_GPIO, BOARD_INITPINS_OESTE_VUELTA_PIN, &OESTE_VUELTA_config);

    gpio_pin_config_t OESTE_VERDE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 30)  */
    GPIO_PinInit(BOARD_INITPINS_OESTE_VERDE_GPIO, BOARD_INITPINS_OESTE_VERDE_PIN, &OESTE_VERDE_config);

    gpio_pin_config_t OESTE_AMARILLO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA12 (pin 32)  */
    GPIO_PinInit(BOARD_INITPINS_OESTE_AMARILLO_GPIO, BOARD_INITPINS_OESTE_AMARILLO_PIN, &OESTE_AMARILLO_config);

    gpio_pin_config_t NORTE_VERDE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_NORTE_VERDE_GPIO, BOARD_INITPINS_NORTE_VERDE_PIN, &NORTE_VERDE_config);

    gpio_pin_config_t NORTE_AMARILLO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_NORTE_AMARILLO_GPIO, BOARD_INITPINS_NORTE_AMARILLO_PIN, &NORTE_AMARILLO_config);

    gpio_pin_config_t NORTE_ROJO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_NORTE_ROJO_GPIO, BOARD_INITPINS_NORTE_ROJO_PIN, &NORTE_ROJO_config);

    gpio_pin_config_t NORTE_VUELTA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_NORTE_VUELTA_GPIO, BOARD_INITPINS_NORTE_VUELTA_PIN, &NORTE_VUELTA_config);

    gpio_pin_config_t ESTE_VUELTA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_ESTE_VUELTA_GPIO, BOARD_INITPINS_ESTE_VUELTA_PIN, &ESTE_VUELTA_config);

    gpio_pin_config_t NORTE_SENSOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_NORTE_SENSOR_GPIO, BOARD_INITPINS_NORTE_SENSOR_PIN, &NORTE_SENSOR_config);

    gpio_pin_config_t ESTE_ROJO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_ESTE_ROJO_GPIO, BOARD_INITPINS_ESTE_ROJO_PIN, &ESTE_ROJO_config);

    gpio_pin_config_t ESTE_AMARILLO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 61)  */
    GPIO_PinInit(BOARD_INITPINS_ESTE_AMARILLO_GPIO, BOARD_INITPINS_ESTE_AMARILLO_PIN, &ESTE_AMARILLO_config);

    gpio_pin_config_t ESTE_VERDE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_ESTE_VERDE_GPIO, BOARD_INITPINS_ESTE_VERDE_PIN, &ESTE_VERDE_config);

    gpio_pin_config_t ESTE_SENSOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_ESTE_SENSOR_GPIO, BOARD_INITPINS_ESTE_SENSOR_PIN, &ESTE_SENSOR_config);

    gpio_pin_config_t OESTE_ROJO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_OESTE_ROJO_GPIO, BOARD_INITPINS_OESTE_ROJO_PIN, &OESTE_ROJO_config);

    gpio_pin_config_t SUR_VERDE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE20 (pin 13)  */
    GPIO_PinInit(BOARD_INITPINS_SUR_VERDE_GPIO, BOARD_INITPINS_SUR_VERDE_PIN, &SUR_VERDE_config);

    gpio_pin_config_t SUR_AMARILLO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE21 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_SUR_AMARILLO_GPIO, BOARD_INITPINS_SUR_AMARILLO_PIN, &SUR_AMARILLO_config);

    gpio_pin_config_t SUR_ROJO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE22 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_SUR_ROJO_GPIO, BOARD_INITPINS_SUR_ROJO_PIN, &SUR_ROJO_config);

    gpio_pin_config_t SUR_VUELTA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE23 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_SUR_VUELTA_GPIO, BOARD_INITPINS_SUR_VUELTA_PIN, &SUR_VUELTA_config);

    gpio_pin_config_t SUR_SENSOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE29 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_SUR_SENSOR_GPIO, BOARD_INITPINS_SUR_SENSOR_PIN, &SUR_SENSOR_config);

