EmmanuelHernandezGonzalez/ProyectosFinales/Tema02Proyecto02_Semaforo/board/pin_mux.c
    const port_pin_config_t OESTE_SENSOR = {/* Internal pull-up resistor is enabled */
                                            kPORT_PullUp,
                                            /* Slow slew rate is configured */
                                            kPORT_SlowSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Low drive strength is configured */
                                            kPORT_LowDriveStrength,
                                            /* Pin is configured as PTA1 */
                                            kPORT_MuxAsGpio};
    /* PORTA1 (pin 27) is configured as PTA1 */
    PORT_SetPinConfig(BOARD_INITPINS_OESTE_SENSOR_PORT, BOARD_INITPINS_OESTE_SENSOR_PIN, &OESTE_SENSOR);

    /* PORTA12 (pin 32) is configured as PTA12 */
    PORT_SetPinMux(BOARD_INITPINS_OESTE_AMARILLO_PORT, BOARD_INITPINS_OESTE_AMARILLO_PIN, kPORT_MuxAsGpio);

    /* PORTA2 (pin 28) is configured as PTA2 */
    PORT_SetPinMux(BOARD_INITPINS_OESTE_VUELTA_PORT, BOARD_INITPINS_OESTE_VUELTA_PIN, kPORT_MuxAsGpio);

    /* PORTA4 (pin 30) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_OESTE_VERDE_PORT, BOARD_INITPINS_OESTE_VERDE_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 43) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_NORTE_VERDE_PORT, BOARD_INITPINS_NORTE_VERDE_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 44) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITPINS_NORTE_AMARILLO_PORT, BOARD_INITPINS_NORTE_AMARILLO_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 45) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_NORTE_ROJO_PORT, BOARD_INITPINS_NORTE_ROJO_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 46) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_NORTE_VUELTA_PORT, BOARD_INITPINS_NORTE_VUELTA_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 55) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_ESTE_VUELTA_PORT, BOARD_INITPINS_ESTE_VUELTA_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t NORTE_SENSOR = {/* Internal pull-up resistor is enabled */
                                            kPORT_PullUp,
                                            /* Slow slew rate is configured */
                                            kPORT_SlowSlewRate,
                                            /* Passive filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Low drive strength is configured */
                                            kPORT_LowDriveStrength,
                                            /* Pin is configured as PTC2 */
                                            kPORT_MuxAsGpio};
    /* PORTC2 (pin 57) is configured as PTC2 */
    PORT_SetPinConfig(BOARD_INITPINS_NORTE_SENSOR_PORT, BOARD_INITPINS_NORTE_SENSOR_PIN, &NORTE_SENSOR);

    /* PORTC3 (pin 58) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_ESTE_ROJO_PORT, BOARD_INITPINS_ESTE_ROJO_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 61) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_ESTE_AMARILLO_PORT, BOARD_INITPINS_ESTE_AMARILLO_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 62) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_ESTE_VERDE_PORT, BOARD_INITPINS_ESTE_VERDE_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t ESTE_SENSOR = {/* Internal pull-up resistor is enabled */
                                           kPORT_PullUp,
                                           /* Fast slew rate is configured */
                                           kPORT_FastSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as PTC7 */
                                           kPORT_MuxAsGpio};
    /* PORTC7 (pin 64) is configured as PTC7 */
    PORT_SetPinConfig(BOARD_INITPINS_ESTE_SENSOR_PORT, BOARD_INITPINS_ESTE_SENSOR_PIN, &ESTE_SENSOR);

    /* PORTD4 (pin 77) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_OESTE_ROJO_PORT, BOARD_INITPINS_OESTE_ROJO_PIN, kPORT_MuxAsGpio);

    /* PORTE20 (pin 13) is configured as PTE20 */
    PORT_SetPinMux(BOARD_INITPINS_SUR_VERDE_PORT, BOARD_INITPINS_SUR_VERDE_PIN, kPORT_MuxAsGpio);

    /* PORTE21 (pin 14) is configured as PTE21 */
    PORT_SetPinMux(BOARD_INITPINS_SUR_AMARILLO_PORT, BOARD_INITPINS_SUR_AMARILLO_PIN, kPORT_MuxAsGpio);

    /* PORTE22 (pin 15) is configured as PTE22 */
    PORT_SetPinMux(BOARD_INITPINS_SUR_ROJO_PORT, BOARD_INITPINS_SUR_ROJO_PIN, kPORT_MuxAsGpio);

    /* PORTE23 (pin 16) is configured as PTE23 */
    PORT_SetPinMux(BOARD_INITPINS_SUR_VUELTA_PORT, BOARD_INITPINS_SUR_VUELTA_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t SUR_SENSOR = {/* Internal pull-up resistor is enabled */
                                          kPORT_PullUp,
                                          /* Slow slew rate is configured */
                                          kPORT_SlowSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as PTE29 */
                                          kPORT_MuxAsGpio};
    /* PORTE29 (pin 21) is configured as PTE29 */
    PORT_SetPinConfig(BOARD_INITPINS_SUR_SENSOR_PORT, BOARD_INITPINS_SUR_SENSOR_PIN, &SUR_SENSOR);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
